# Задания: Z2 63018
Логическая функция F задаётся выражением:

((x → y) ∧ (z ≡ ¬w))→(u ≡ (x ∨ z)).

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных u, w, x, y, z.

В ответе напишите буквы u, w, x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

## Код:
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                for u in range(2):
                    if not(((x <= y)and(z == (not(w)))) <= (u == (x or z))):
                        print(x, y, z, w, u)
```
### Ответ:
```
w z y x u
0 0 1 0 0
0 1 1 0 0
0 0 0 1 1
1 1 0 1 0

# Задание: Z2 14688
Логическая функция F задаётся выражением (x ∨ y) → (z ≡ x).

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.

В ответе напишите буквы x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

## Код:
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            if not((x or y) <= (z == x)):
                print(x, y, z)
```

### Ответ:
```
x z y
1 0 0
1 0 1
0 1 1

# Тип Z2 81786
Миша заполнял таблицу истинности логической функции F: (x∨y)∧¬(y≡z)∧¬w, 

но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.

Определите, какому столбцу таблицы соответствует каждая из переменных w, x, y, z
В ответе напишите буквы w, x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
****

## 
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if (x or y) and (not(y == z)) and (not (w)):
                    print(x, y, z, w)
```

# 
```
Ответ:

x y z w

0 1 0 0

1 0 1 0

1 1 0 0
``


# Задание: z8 10384
Алексей составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Алексей использует 4-⁠буквенные слова, в которых есть только буквы A, B, C, D, X, причём буква X может появиться на первом месте или не появиться вовсе. Сколько различных кодовых слов может использовать Алексей?
## Код:
```
import itertools
alphabet = "ABCDX"
ar = itertools.product(alphabet, repeat=4) =
arl = []
for i in ar:
    arl.append(list(i))
count = 0
for e in arl:
    if (e[0] == 'X' or e[0] != 'X') and e[1] != 'X' and e[2] != 'X' and e[3] != 'X':
        count += 1
print(count)
```
### Ответ:
320

# Задание: z8 61388
Ольга составляет 5-⁠буквенные коды из букв, входящих в слово ОЛЬГА, располагает эти коды в алфавитном порядке и нумерует, начиная с 1. Начало списка выглядит так:

1.  ААААА

2.  ААААГ

3.  ААААЛ

4.  ААААО

5.  ААААЬ

Под каким номером будет записан код ОЛЬГА?
## Код:
```
from itertools import product
 
data = list(product('АГЛОЬ', repeat=5))
res = data.index(('О', 'Л', 'Ь', 'Г','А'))
print(res + 1)
```
### Ответ:
2231

# Задание: z8 64938

Назовём ряд из двух цифр подходящим, если выполняется любое из двух условий:

1)  сумма цифр чётна и вторая цифра больше первой;

2)  сумма цифр нечётна и вторая цифра меньше первой.

Назовём многозначное число подходящим, если любые две соседние цифры в его записи образуют подходящий ряд.

Примеры подходящих чисел: 26, 63, 30, 2630, 26308.

Пример неподходящего числа: 2638. Это число нельзя считать подходящим, так как соседние цифры 3 и 8 в его записи образуют неподходящий ряд.

Сколько существует подходящих 11-⁠значных 9-⁠ричных чисел?

## Код:
```
def f(n):
    s = str(n)
    if len(s) == 11:
        return 1
    podr = []
    for i in range(9):
        if (int(s[-1]) + i)%2 == 0 and i > int(s[-1]):
            podr.append(int(s+str(i)))
        if (int(s[-1]) + i)%2 != 0 and i < int(s[-1]):
            podr.append(int(s + str(i)))
    return sum(f(i) for i in podr)
 
print(sum(f(i) for i in range(1,9)))
```
### Ответ:
8388608
